app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 01 Dec 2015 17:16:13 UTC +00:00], ["updated_at", Tue, 01 Dec 2015 17:16:13 UTC +00:00]]

  def destroy
    @cart.destroy if @cart.id == session[:cart_id]
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190962]]