app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id, product.price)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 28 Nov 2015 01:17:56 UTC +00:00], ["updated_at", Sat, 28 Nov 2015 01:17:56 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", Sat, 28 Nov 2015 01:17:56 UTC +00:00], ["product_id", 2], ["updated_at", Sat, 28 Nov 2015 01:17:56 UTC +00:00]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 2  [["quantity", 2], ["updated_at", Mon, 30 Nov 2015 19:58:16 UTC +00:00]]

  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 6]]