app/views/store/index.html.erb

SELECT "products".* FROM "products" ORDER BY "products".updated_at DESC LIMIT 1
---
<h1>Your Pragmatic Catalog</h1>
<% cache['store', Product.latest do] %>